app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("title", "director", "runtime_in_minutes", "description", "poster_image_url", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Roberto Benignii"], ["updated_at", "2016-06-22 21:36:30.165450"], ["id", 1]]